-- types
INSERT INTO types(name) VALUES
('СЫР'),
('МОЛОКО'),
('МОРОЖЕНОЕ'),
('ХЛЕБ'),
('КОЛБАСА');

-- products
INSERT INTO products(name, expired_date, price, type_id) VALUES
('Сыр моцарелла', '2026-12-31', 50.00, 1),
('Сыр плавленный', '2024-01-01', 20.00, 1),  -- просрочен
('Молоко 3.2%', '2026-05-01', 15.00, 2),
('Молоко фермерское', '2026-06-01', 50.00, 2),
('Ванильное мороженое', '2027-01-01', 25.00, 3),
('Шоколадное мороженое', '2027-01-01', 30.00, 3),
('Хлеб белый', '2024-02-01', 10.00, 4), -- просрочен
('Хлеб черный', '2026-03-04', 12.00, 4),
('Колбаса докторская', '2026-04-01', 40.00, 5);